
      *--------------------
      * LINKAGE SECTION.
      *--------------------
        01 DFHCOMMAREA.
           03 WS-PAYS                  PIC X(2).
           03 WS-TRANS                 PIC X(4).
           03 WS-CODOPE                PIC X(2).
           03 WS-CONTRACT              PIC 9(11).
           03 WS-REST                  PIC 9(11).
           03 ErrorCode                PIC X(2).
